# MajorLapSpliceFailure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FabricFailures..::..MajorLapSpliceFailure Property
BuiltInFailures..::..FabricFailures Class See Also
---
The lap splice in the major direction is greater than the half of the overall length.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MajorLapSpliceFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MajorLapSpliceFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MajorLapSpliceFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FabricFailures Class
Autodesk.Revit.DB Namespace